app/controllers/api/v1/comments_controller.rb

  def index
    @comments = Comment.where(post_id: params[:post_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 14]]