app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
---
  def index
    @posts = Post.where(author_id: params[:user_id])