app/views/posts/index.html.erb

          <% else %>
              <% post.recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["post_id", 2], ["post_id", 5], ["post_id", 4], ["post_id", 7], ["post_id", 1], ["post_id", 3], ["post_id", 6], ["post_id", 8]]