app/views/posts/show.html.erb

        <% else %>
          <% @post.comments.each do |comment| %>
            <% poster = comment.author_id%>
            <% poster = User.find(poster) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]