app/controllers/comments_controller.rb

  def create
    new_comment = Comment.new(text: params[:comment][:text], post: Post.find(params[:post_id]), author: current_user)
    if new_comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 6]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "It is too early for this"], ["created_at", "2023-02-02 22:23:32.484161"], ["updated_at", "2023-02-02 22:23:32.484161"], ["author_id", 5], ["post_id", 6]]

  def destroy
    comment = Comment.find(params[:id])
    comment.destroy
    # reduce the comments counter for the post by 1
    Post.decrement_counter(:comments_counter, comment.post_id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) - $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 6]]