app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-01-31 05:43:03.204185"], ["updated_at", "2023-01-31 05:43:03.204185"], ["author_id", 1], ["post_id", 6]]
---
  def new
    post = Post.find(params[:post_id])
    author = User.find(params[:user_id])
    like = Like.new(author: author, post: post)
    if like.save