app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:comments).where(author_id: params[:user_id])
    @user = User.where(id: params[:user_id]).first
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["post_id", 2], ["post_id", 5], ["post_id", 4], ["post_id", 7], ["post_id", 1], ["post_id", 3], ["post_id", 6], ["post_id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN ($1, $2, $3)  [["user_id", "2"], ["user_id", "3"], ["user_id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    new_post = Post.new(title: params[:post][:title], text: params[:post][:text], author: current_user)
    if new_post.save
---
INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @post = Post.find(params[:id])
    if @post.comments_counter.positive? || @post.likes_counter.positive?
      @post.comments.destroy_all
      @post.likes.destroy_all
    end
    @post.destroy
    User.decrement_counter(:posts_counter, @post.author_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 13]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 12]]
UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) - $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 5]]

  def load_and_authorize_resource
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]