app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  def index
    @posts = Post.all
    @user = User.where(id: params[:user_id]).first
    @comments = Comment.all

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  def show
    @post = Post.find(params[:id])
    @comments = Comment.all