app/controllers/users_controller.rb

  def show
    #Find the user id ad author id
    @user = User.find(params[:id] )
    @posts = Post.where(author_id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 1]]