app/models/comment.rb

UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 6]]
---
  def update_comment_counter
    post_id = post.id
    Post.increment_counter(:comments_counter, post_id)