app/models/like.rb

  def update_likes_counter
    post_id = post.id
    Post.increment_counter(:likes_counter, post_id)
---
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 6]]