app/models/post.rb

  def posts_counter_update
    author_id = author.id
    User.increment_counter(:posts_counter, author_id)
---
UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) + $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 3]]